# 6. Data Preparation

## List of Content:
- ### 6.1 Reading and Writing Data in Text Format
    - Reading Data in Text Format
    - Dealing with missing values
    - Reading Text Files in Pieces
    - Writing Data to Text Format
    - JSON Data
    - Web Scraping
- ### 6.2 Interacting with Web APIs
- ### 6.3 Binary Data Formats
    - Reading Microsoft Excel Files
- ### 6.4 Interacting with Databases

In [63]:
import numpy as np
import pandas as pd

Read form CSV file:

In [2]:
pd.read_csv("../examples/ex2.csv") # by default, the first row will serves as a header row for this dataframe

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

Put the `header` param value to **None** to use the default pandas indexing method:

In [3]:
pd.read_csv("../examples/ex2.csv", header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

To add a custom header row, pass a list to `names` param:

In [4]:
pd.read_csv("../examples/ex2.csv", names=list("abcdm"))

   a   b   c   d      m
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

To add an index from your data, use `index_col` param:

In [5]:
pd.read_csv("../examples/ex2.csv", names=list("abcdm"), index_col="a")

    b   c   d      m
a
1   2   3   4  hello
5   6   7   8  world
9  10  11  12    foo

For hierarchical indexing, you can pass a list of indices, consider:

In [6]:
print("Row data:\n")
!cat ../examples/csv_mindex.csv
pd.read_csv("../examples/csv_mindex.csv", index_col=["key1", "key2"])

Row data:

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

For non-comma separated files, you have the option to specify a pattern representing the separator or delimiter using the `sep` parameter. Let's take, for example, data with varying lengths of white spaces as separators:

In [7]:
print("Row Data: \n")
! cat ../examples/ex3.txt

pd.read_csv("../examples/ex3.txt", sep='\s+')

Row Data:

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

Because there is missing column and just we have A, B, and C column headers, the first column used as index.

Use `skiprows` param to skip list of rows, consider:

In [8]:
print("Row Data:\n")
!cat ../examples/ex4.csv

pd.read_csv("../examples/ex4.csv", skiprows=[0, 2, 3])

Row Data:

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### Dealing with missing values
By default, pandas uses a set of commonly occurring sentinels in row file, such as **NA** and **NULL**, and marks them as **NaN**, consider:

In [9]:
print("Row Data:\n")
!cat ../examples/ex5.csv

df = pd.read_csv("../examples/ex5.csv")
df

Row Data:

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

To designate additional values that occur in the file as **NaN** , you can provide them as a list to the `na_values` parameter. For example:

In [10]:
pd.read_csv("../examples/ex5.csv", na_values=[1, 2, 3])

  something    a     b     c   d message
0       one  NaN   NaN   NaN   4     NaN
1       two  5.0   6.0   NaN   8   world
2     three  9.0  10.0  11.0  12     foo

pandas.read_csv has a list of many default **NA** value representations, but
these defaults can be disabled with the `keep_default_na` param:

In [11]:
pd.read_csv("../examples/ex5.csv", keep_default_na=False)

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

Different **NA** sentinels can be specified for each column in a dictionary:

In [12]:
sentinels = {"message": ["foo", "worl"], "something": ["two"]}
pd.read_csv("../examples/ex5.csv", na_values=sentinels, keep_default_na=False)

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

### Reading Text Files in Pieces

You can adjust the default number of displayed rows by modifying the `pandas.options` setting. Here's how:

In [13]:
print("Using the default setting:\n")
print(pd.read_csv("../examples/ex6.csv"))

pd.options.display.max_rows = 10
print("\n\nAfter modification:")
pd.read_csv("../examples/ex6.csv")

Using the default setting:

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]


After modification:

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

If you want to read only a small number of rows (avoiding reading the entire
file), specify that with `nrows`:

In [14]:
pd.read_csv("../examples/ex6.csv", nrows=10)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q
6 -0.776764  0.935518 -0.332872 -1.875641   U
7 -0.913135  1.530624 -0.572657  0.477252   K
8  0.358480 -0.497572 -0.367016  0.507702   S
9 -1.740877 -1.160417 -1.637830  2.172201   G

To read a file in pieces, specify a `chunksize` as a number of rows.
<br>
For example, if you have a large file with millions of rows, reading it all at once may consume a lot of memory. By using chunksize, you can read the file in smaller portions, process each chunk individually, and then combine the results. This can be helpful for working with large datasets while managing memory usage efficiently.

Then, you can iterate on each chunk and apply some code on it.

In [15]:
chunks = pd.read_csv("../examples/ex6.csv", chunksize=1000)

In [16]:
i = 1
for chunk in chunks:
    print(f"last row in {i}th chunk:")
    print(chunk.iloc[[-1]])
    i += 1

last row in 1th chunk:
          one       two     three      four key
999 -0.096376 -1.012999 -0.657431 -0.573315   K
last row in 2th chunk:
           one       two     three      four key
1999 -0.096376 -1.012999 -0.657431 -0.573315   D
last row in 3th chunk:
           one       two     three      four key
2999 -0.096376 -1.012999 -0.657431 -0.573315   F
last row in 4th chunk:
           one       two     three      four key
3999 -0.096376 -1.012999 -0.657431 -0.573315   M
last row in 5th chunk:
           one       two     three      four key
4999 -0.096376 -1.012999 -0.657431 -0.573315   U
last row in 6th chunk:
           one       two     three      four key
5999 -0.096376 -1.012999 -0.657431 -0.573315   3
last row in 7th chunk:
           one       two     three      four key
6999 -0.096376 -1.012999 -0.657431 -0.573315   O
last row in 8th chunk:
           one       two     three      four key
7999 -0.096376 -1.012999 -0.657431 -0.573315   2
last row in 9th chunk:
           one       two     three      four key
8999 -0.096376 -1.012999 -0.657431 -0.573315   M
last row in 10th chunk:
           one       two     three      four key
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

### Writing Data to Text Format

Using DataFrame’s `to_csv` method, we can write the data out to a comma-
separated file:

In [17]:
df.to_csv("../examples/out.csv")
!cat ../examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

With no other options specified, both the row and column labels are written.
Both of these can be disabled by setting both `index` and `head` param to **False**:

In [18]:
df.to_csv("../examples/out.csv", index=False, header=False)
!cat ../examples/out.csv

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

Missing values appear as empty strings in the output. However, you can represent them by some other sentinel value by passing it to the `na_rep` param, consider:

In [19]:
df.to_csv("../examples/out.csv", na_rep="NULL", index=False)
! cat ../examples/out.csv

something,a,b,c,d,message
one,1,2,3.0,4,NULL
two,5,6,NULL,8,world
three,9,10,11.0,12,foo

You can replace the seprator by setting the new one to `sep` param, consider:

In [20]:
df.to_csv("../examples/out.csv", sep='|', index=False)
! cat ../examples/out.csv

something|a|b|c|d|message
one|1|2|3.0|4|
two|5|6||8|world
three|9|10|11.0|12|foo

You can also write only a subset of the columns, and in an order of your
choosing:

In [21]:
df.to_csv("../examples/out.csv", columns=list("bca"), index=False)
! cat ../examples/out.csv

b,c,a
2,3.0,1
6,,5
10,11.0,9

### JSON Data

To convert a Python dictionary to a **JSON** object, or opposite, you can use the `json.loads()` and `json.dumps()` functions from `json` module.

In [22]:
import json
obj = """
{"name": "Wes",
"cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
"pet": null,
"siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
{"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

data = json.loads(obj)
print(type(data))
print(data, '\n')

asjson = json.dumps(data)
print(type(asjson))
print(asjson, '\n')

<class 'dict'>
{'name': 'Wes', 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'], 'pet': None, 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']}, {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

<class 'str'>
{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}

The default options for `pandas.read_json` assume that each object in the
**JSON** array is a row in the table:

In [23]:
print("Row Data:\n")
!cat ../examples/example.json

pd.read_json("../examples/example.json")

Row Data:

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

### Web Scraping

Python has many libraries for reading and writing data in the ubiquitous
**HTML** formats. Examples include `lxml`, `Beautiful Soup`, and
`html5lib`.<br>
Pandas has a built-in function, `pandas.read_html`, which uses all of these
libraries to automatically parse tables out of **HTML** files as DataFrame
objects.
<br>
First, you
must install some additional libraries used by read_html.
<br>
run:<br>
`!conda install lxml beautifulsoup4 html5lib`<br>
or<br>
`!pip install lxml beautifulsoup4 html5lib`<br>
if you use `pip`.

The `pd.read_html` function return a list of all tables in a given **HTML** page, consider:

In [24]:
tables = pd.read_html("../examples/fdic_failed_bank_list.html")
tables[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"
...,...,...,...,...,...,...,...
542,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
543,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
544,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
545,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
546,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

## 6.2 Interacting with Web APIs

lets say you want to scrape non local html page, say [List of countries by average wage](https://en.wikipedia.org/wiki/List_of_countries_by_average_wage), you can do such so using `requests` module, for example:

In [64]:
import requests

# URL of the webpage to scrape
url = 'https://en.wikipedia.org/wiki/List_of_countries_by_average_wage'

# Send a GET request to the webpage
response = requests.get(url)

# Check if the request was successful (status code 200)
if response.status_code == 200:
    # Now you can process the HTML content in response.text
    # For example, you can use BeautifulSoup or pandas to extract information from HTML
    # Here's where you would write your scraping code
    print("Webpage scraped successfully!")
    tables = pd.read_html(response.text)
    print(tables[0])
else:
    print("Failed to retrieve webpage. Status code:", response.status_code)

Webpage scraped successfully!
            Country     2000   2010   2020     2022
0         Iceland *  57008.0  54268  71687  79473.0
1      Luxembourg *  64217.0  71085  74839  78310.0
2   United States *  61132.0  67263  77567  77463.0
3     Switzerland *  60768.0  67961  69728  72993.0
4         Belgium *  60929.0  63295  63677  64848.0
..              ...      ...    ...    ...      ...
33       Slovakia *  16381.0  22642  27052  26263.0
34         Greece *  29797.0  35454  27747  25979.0
35       Colombia *      NaN  19800  24681      NaN
36         France *  43694.0  49926  50550  52764.0
37         Mexico *  17311.0  17618  17467  16685.0

[38 rows x 5 columns]

## 6.3 Binary Data Formats

One simple way to store (*serialize*) data in binary format is using Python’s
built-in `pickle` module. <br>You can serialize your dataframes and deserialize them using `pandas.to_pickle` and `pandas.read_pickle`:

In [26]:
df.to_pickle("../examples/frame_pickle")
pd.read_pickle("../examples/frame_pickle")

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

### Reading Microsoft Excel Files

Pandas also supports reading tabular data stored in Excel 2003 (and higher)
files using either the `pandas.ExcelFile` class or `pandas.read_excel`
function:

In [53]:
xlsx = pd.ExcelFile("../examples/ex1.xlsx")
xlsx.sheet_names

['Sheet1']

This Excel file has one sheet, lets `parse` it to pandas DataFrame object:

In [54]:
xlsx.parse(sheet_name='Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

as shown, this sheet has an index column, so, we can adjust that by passing the column header into `index_col` param as we did previously:

In [59]:
xdata = xlsx.parse(sheet_name='Sheet1', index_col=0)
xdata

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

for `pd.read_excel` you should specify the sheet name you want to retrieve if you have multiple sheets:

In [60]:
pd.read_excel("../examples/ex1.xlsx", sheet_name='Sheet1', index_col=0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

to write in excel file, use the dataframe's `to_excel` methos:

In [61]:
xdata.to_excel("../examples/new1.xlsx", 'Sheet1')
pd.read_excel("../examples/new1.xlsx", sheet_name='Sheet1', index_col=0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

## 6.4 Interacting with Databases

The choice of database is usually dependent on the performance,
data integrity, and scalability needs of an application.<br>
Pandas has some functions to simplify loading the results of a **SQL** query into
a `DataFrame`.<br>In my case, I’ll use `mysql-connector-python` module. To use it, make sure to have `mysql-connector-python` installed using you preferred python package manager:

In [50]:
import mysql.connector

conn = mysql.connector.connect(
    host='localhost',
    username='username',
    password='password',
    database='db_name'
)

After establishing a connection, you can use the method `cursor` to create a cursor object, which is then used to modify your database.<br> Then, the `cursor.execute` function is used to run SQL queries and commands.

In [51]:
cursor = conn.cursor()
cursor.execute("""
                USE data_analysis_using_python;
               """)

cursor.execute("SELECT * FROM tmp")

Use `cursor.fetchall` to return a list contains the result of the executed query:

In [52]:
table = cursor.fetchall()
table

[(1, 'Ahmad', 20), (2, 'Mahmoud', 24), (3, 'Ali', 22)]

Use `cursor.description` to provide information about the result set of the last executed query:

In [54]:
cursor.description

[('Id', 3, None, None, None, None, 0, 53251, 63),
 ('Name', 253, None, None, None, None, 1, 0, 255),
 ('Age', 3, None, None, None, None, 1, 32768, 63)]

Now, this list of tuples (`table`) can be then passed into pandas DataFrame's constructor to create a DataFrame object for `tmp` table with header names from `cursor.description` function as follow:

In [61]:
df = pd.DataFrame(table, columns=[_[0] for _ in cursor.description])
df.set_index("Id", inplace=True) # Set "Id" column as the index
df

       Name  Age
Id
1     Ahmad   20
2   Mahmoud   24
3       Ali   22

Finally, don't forget to close the connectios for efficient resource management:

In [62]:
cursor.close()
conn.close()